{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence file listing transaction reference-field enhancements and associated frontend files for multiple features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend converter components and utilities including reference‑field updates.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark mode using OKLCH colors.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps the main converter page in the AppShell layout.",
  "frontend/src/components/layout/AppShell.tsx": "App layout providing header, footer, and container structure for all pages.",
  "frontend/src/features/converter/components/ConversionGuidance.tsx": "UI card explaining the three‑step workflow and benefits of Excel export.",
  "frontend/src/features/converter/components/ParsingSettingsPanel.tsx": "Settings UI for bank template, date format, page range, and header detection, with reparse support.",
  "frontend/src/features/converter/components/TransactionsTableEditor.tsx": "Editable table component allowing users to modify, save, and delete parsed transaction rows.",
  "frontend/src/features/converter/components/UploadDropzone.tsx": "Drag-and-drop or file-input PDF uploader with processing status and UI feedback.",
  "frontend/src/features/converter/lib/bankTemplates.ts": "Defines bank-specific parsing templates and utilities for detecting and retrieving template configurations.",
  "frontend/src/features/converter/lib/exportXlsx.ts": "Loads SheetJS at runtime and exports normalized transactions to a formatted XLSX file.",
  "frontend/src/features/converter/lib/normalize.ts": "Normalizes transaction dates and amounts to consistent formats for downstream processing.",
  "frontend/src/features/converter/lib/pdfExtract.ts": "Loads PDF.js, extracts text from pages, detects bank type, and parses transactions with diagnostics.",
  "frontend/src/features/converter/PdfToExcelPage.tsx": "Manages the upload→review→export flow, PDF extraction, normalization, and Excel export logic.",
  "frontend/src/features/converter/types.ts": "Type definitions for transactions, parsing settings, extraction results, and bank template configs.",
  "frontend/src/hooks/useActor.ts": "React hook that manages authenticated or anonymous backend actor creation and refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Exports a placeholder hook for future backend queries, currently returning an empty object.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH CSS variables for light and dark mode with an emerald-themed design.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins using CSS variables.",
  "project_state.json": "Stores project metadata, including goals, architecture notes, feature list, and known issues for an Indian bank statement PDF-to-Excel converter."
}